---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveNumParam
source: html/d049ba70-4068-80e6-e7c7-c61bdfe750ab.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PointAdaptiveNumParam Property

"Number"

## Syntax (C#)
```csharp
public static ForgeTypeId PointAdaptiveNumParam { get; }
```